node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "global_step"
    }
  }
}
node {
  name: "global_step/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "global_step"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/Assign"
  op: "AssignVariableOp"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "global_step"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "global_step"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond"
  op: "If"
  input: "global_step/VarIsInitializedOp"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "Tcond"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "Tin"
    value {
      list {
        type: DT_RESOURCE
        type: DT_INT64
      }
    }
  }
  attr {
    key: "Tout"
    value {
      list {
        type: DT_INT64
      }
    }
  }
  attr {
    key: "_lower_using_switch_merge"
    value {
      b: true
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "else_branch"
    value {
      func {
        name: "global_step_cond_false_7120"
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "then_branch"
    value {
      func {
        name: "global_step_cond_true_7119"
      }
    }
  }
}
node {
  name: "global_step/cond/Identity"
  op: "Identity"
  input: "global_step/cond"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/add"
  op: "AddV2"
  input: "global_step/cond/Identity"
  input: "global_step/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "normalize_element/component_0"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 100
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 100
          }
        }
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00000"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00001"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00002"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00003"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00004"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00005"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00006"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00007"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00008"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00009"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00010"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00011"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00012"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00013"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00014"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00015"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00016"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00017"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00018"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00019"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00020"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00021"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00022"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00023"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00024"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00025"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00026"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00027"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00028"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00029"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00030"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00031"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00032"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00033"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00034"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00035"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00036"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00037"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00038"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00039"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00040"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00041"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00042"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00043"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00044"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00045"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00046"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00047"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00048"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00049"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00050"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00051"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00052"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00053"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00054"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00055"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00056"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00057"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00058"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00059"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00060"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00061"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00062"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00063"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00064"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00065"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00066"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00067"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00068"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00069"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00070"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00071"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00072"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00073"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00074"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00075"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00076"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00077"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00078"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00079"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00080"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00081"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00082"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00083"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00084"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00085"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00086"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00087"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00088"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00089"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00090"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00091"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00092"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00093"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00094"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00095"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00096"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00097"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00098"
        string_val: "D:\\luckma\\data\\processed\\train\\price\\bn\\05-21-20\\adx.tfrecords\\part-r-00099"
      }
    }
  }
}
node {
  name: "TensorSliceDataset"
  op: "TensorSliceDataset"
  input: "normalize_element/component_0"
  device: "/device:CPU:0"
  attr {
    key: "Toutput_types"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "cycle_length"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: -1
      }
    }
  }
}
node {
  name: "block_length"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 1
      }
    }
  }
}
node {
  name: "num_parallel_calls"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: -1
      }
    }
  }
}
node {
  name: "ParallelInterleaveDatasetV2"
  op: "ParallelInterleaveDatasetV2"
  input: "TensorSliceDataset"
  input: "cycle_length"
  input: "block_length"
  input: "num_parallel_calls"
  device: "/device:CPU:0"
  attr {
    key: "Targuments"
    value {
      list {
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "f"
    value {
      func {
        name: "__inference_Dataset_interleave_lambda_7205"
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "sloppy"
    value {
      b: false
    }
  }
}
node {
  name: "filename"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: ""
      }
    }
  }
}
node {
  name: "CacheDataset"
  op: "CacheDataset"
  input: "ParallelInterleaveDatasetV2"
  input: "filename"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_FLOAT
      }
    }
  }
}
node {
  name: "buffer_size"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 4508
      }
    }
  }
}
node {
  name: "seed"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "seed2"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "ShuffleDataset"
  op: "ShuffleDataset"
  input: "CacheDataset"
  input: "buffer_size"
  input: "seed"
  input: "seed2"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "reshuffle_each_iteration"
    value {
      b: true
    }
  }
}
node {
  name: "count"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: -1
      }
    }
  }
}
node {
  name: "RepeatDataset"
  op: "RepeatDataset"
  input: "ShuffleDataset"
  input: "count"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_FLOAT
      }
    }
  }
}
node {
  name: "batch_size"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 64
      }
    }
  }
}
node {
  name: "drop_remainder"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_BOOL
        tensor_shape {
        }
        bool_val: true
      }
    }
  }
}
node {
  name: "BatchDatasetV2"
  op: "BatchDatasetV2"
  input: "RepeatDataset"
  input: "batch_size"
  input: "drop_remainder"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          dim {
            size: 64
          }
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "parallel_copy"
    value {
      b: false
    }
  }
}
node {
  name: "buffer_size_1"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: -1
      }
    }
  }
}
node {
  name: "PrefetchDataset"
  op: "PrefetchDataset"
  input: "BatchDatasetV2"
  input: "buffer_size_1"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "legacy_autotune"
    value {
      b: true
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          dim {
            size: 64
          }
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "slack_period"
    value {
      i: 0
    }
  }
}
node {
  name: "optimizations"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 3
          }
        }
        string_val: "map_and_batch_fusion"
        string_val: "noop_elimination"
        string_val: "shuffle_and_repeat_fusion"
      }
    }
  }
}
node {
  name: "OptimizeDataset"
  op: "OptimizeDataset"
  input: "PrefetchDataset"
  input: "optimizations"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "optimization_configs"
    value {
      list {
        s: "map_vectorization:use_choose_fastest:false"
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          dim {
            size: 64
          }
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_FLOAT
      }
    }
  }
}
node {
  name: "ModelDataset"
  op: "ModelDataset"
  input: "OptimizeDataset"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "algorithm"
    value {
      i: 0
    }
  }
  attr {
    key: "cpu_budget"
    value {
      i: 0
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          dim {
            size: 64
          }
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_FLOAT
      }
    }
  }
}
node {
  name: "IteratorV2"
  op: "IteratorV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          dim {
            size: 64
          }
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "MakeIterator"
  op: "MakeIterator"
  input: "ModelDataset"
  input: "IteratorV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@IteratorV2"
      }
    }
  }
}
node {
  name: "IteratorToStringHandle"
  op: "IteratorToStringHandle"
  input: "IteratorV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "IteratorGetNext"
  op: "IteratorGetNext"
  input: "IteratorV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          dim {
            size: 64
          }
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
        shape {
          dim {
            size: 64
          }
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_FLOAT
      }
    }
  }
}
node {
  name: "DeserializeSparse"
  op: "DeserializeSparse"
  input: "IteratorGetNext"
  attr {
    key: "Tserialized"
    value {
      type: DT_VARIANT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "unstack"
  op: "Unpack"
  input: "DeserializeSparse:2"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
        shape {
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
  attr {
    key: "num"
    value {
      i: 3
    }
  }
}
node {
  name: "Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 64
      }
    }
  }
}
node {
  name: "stack"
  op: "Pack"
  input: "Const"
  input: "unstack:1"
  input: "unstack:2"
  attr {
    key: "N"
    value {
      i: 3
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "DeserializeSparse_1"
  op: "DeserializeSparse"
  input: "IteratorGetNext:1"
  attr {
    key: "Tserialized"
    value {
      type: DT_VARIANT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "unstack_1"
  op: "Unpack"
  input: "DeserializeSparse_1:2"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
        shape {
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
  attr {
    key: "num"
    value {
      i: 3
    }
  }
}
node {
  name: "Const_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 64
      }
    }
  }
}
node {
  name: "stack_1"
  op: "Pack"
  input: "Const_1"
  input: "unstack_1:1"
  input: "unstack_1:2"
  attr {
    key: "N"
    value {
      i: 3
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "DeserializeSparse_2"
  op: "DeserializeSparse"
  input: "IteratorGetNext:2"
  attr {
    key: "Tserialized"
    value {
      type: DT_VARIANT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "unstack_2"
  op: "Unpack"
  input: "DeserializeSparse_2:2"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
        shape {
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
  attr {
    key: "num"
    value {
      i: 3
    }
  }
}
node {
  name: "Const_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 64
      }
    }
  }
}
node {
  name: "stack_2"
  op: "Pack"
  input: "Const_2"
  input: "unstack_2:1"
  input: "unstack_2:2"
  attr {
    key: "N"
    value {
      i: 3
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "DeserializeSparse_3"
  op: "DeserializeSparse"
  input: "IteratorGetNext:3"
  attr {
    key: "Tserialized"
    value {
      type: DT_VARIANT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "unstack_3"
  op: "Unpack"
  input: "DeserializeSparse_3:2"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
        shape {
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
  attr {
    key: "num"
    value {
      i: 3
    }
  }
}
node {
  name: "Const_3"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 64
      }
    }
  }
}
node {
  name: "stack_3"
  op: "Pack"
  input: "Const_3"
  input: "unstack_3:1"
  input: "unstack_3:2"
  attr {
    key: "N"
    value {
      i: 3
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "DeserializeSparse_4"
  op: "DeserializeSparse"
  input: "IteratorGetNext:4"
  attr {
    key: "Tserialized"
    value {
      type: DT_VARIANT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "unstack_4"
  op: "Unpack"
  input: "DeserializeSparse_4:2"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
        shape {
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
  attr {
    key: "num"
    value {
      i: 3
    }
  }
}
node {
  name: "Const_4"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 64
      }
    }
  }
}
node {
  name: "stack_4"
  op: "Pack"
  input: "Const_4"
  input: "unstack_4:1"
  input: "unstack_4:2"
  attr {
    key: "N"
    value {
      i: 3
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "DeserializeSparse_5"
  op: "DeserializeSparse"
  input: "IteratorGetNext:5"
  attr {
    key: "Tserialized"
    value {
      type: DT_VARIANT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "unstack_5"
  op: "Unpack"
  input: "DeserializeSparse_5:2"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
        shape {
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
  attr {
    key: "num"
    value {
      i: 3
    }
  }
}
node {
  name: "Const_5"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 64
      }
    }
  }
}
node {
  name: "stack_5"
  op: "Pack"
  input: "Const_5"
  input: "unstack_5:1"
  input: "unstack_5:2"
  attr {
    key: "N"
    value {
      i: 3
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "DeserializeSparse_6"
  op: "DeserializeSparse"
  input: "IteratorGetNext:6"
  attr {
    key: "Tserialized"
    value {
      type: DT_VARIANT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "unstack_6"
  op: "Unpack"
  input: "DeserializeSparse_6:2"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
        shape {
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
  attr {
    key: "num"
    value {
      i: 3
    }
  }
}
node {
  name: "Const_6"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 64
      }
    }
  }
}
node {
  name: "stack_6"
  op: "Pack"
  input: "Const_6"
  input: "unstack_6:1"
  input: "unstack_6:2"
  attr {
    key: "N"
    value {
      i: 3
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "rnn_model/sequence_input_layer/sequence_features/bas_rq/SparseToDense/default_value"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "rnn_model/sequence_input_layer/sequence_features/bas_rq/SparseToDense"
  op: "SparseToDense"
  input: "DeserializeSparse"
  input: "stack"
  input: "DeserializeSparse:1"
  input: "rnn_model/sequence_input_layer/sequence_features/bas_rq/SparseToDense/default_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tindices"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
          dim {
            size: -1
          }
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "validate_indices"
    value {
      b: true
    }
  }
}
node {
  name: "rnn_model/sequence_input_layer/sequence_features/bas_rq/Shape"
  op: "Shape"
  input: "rnn_model/sequence_input_layer/sequence_features/bas_rq/SparseToDense"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "rnn_model/sequence_input_layer/sequence_features/bas_rq/strided_slice/stack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "rnn_model/sequence_input_layer/sequence_features/bas_rq/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "rnn_model/sequence_input_layer/sequence_features/bas_rq/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "rnn_model/sequence_input_layer/sequence_features/bas_rq/strided_slice"
  op: "StridedSlice"
  input: "rnn_model/sequence_input_layer/sequence_features/bas_rq/Shape"
  input: "rnn_model/sequence_input_layer/sequence_features/bas_rq/strided_slice/stack"
  input: "rnn_model/sequence_input_layer/sequence_features/bas_rq/strided_slice/stack_1"
  input: "rnn_model/sequence_input_layer/sequence_features/bas_rq/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "rnn_model/sequence_input_layer/sequence_features/bas_rq/concat/values_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
